Revit 2024 API
InternalDefinition.GetGroupTypeId Method
 Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override ForgeTypeId GetGroupTypeId()
Visual Basic
Public Overrides Function GetGroupTypeId As ForgeTypeId
Visual C++
public:
virtual ForgeTypeId^ GetGroupTypeId() override
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace